TEAM_NAMES = [
    "95-й квартал (команда КВН)",
    "Азия MIX",
    "БАК (команда КВН)",
    "БГУ (команда КВН, второй состав)",
    "Борцы — Северный десант",
    "Ботанический сад (команда КВН)",
    "Вятка (команда КВН)",
    "ГородЪ ПятигорскЪ",
    "Дети лейтенанта Шмидта",
    "Днепр (команда КВН)",
    "ДПИ (команда КВН)",
    "ЕрМИ (команда КВН)",
    "Запорожье — Кривой Рог — Транзит",
    "Казахи (команда КВН)",
    "Кефир (команда КВН)",
    "Левый берег (команда КВН)",
    "Лица уральской национальности",
    "Максимум (команда КВН)",
    "Махачкалинские бродяги",
    "Мегаполис (команда КВН)",
    "Нарты из Абхазии",
    "НГУ (команда КВН)",
    "Новые армяне",
    "Обычные люди (команда КВН)",
    "ОГУ (команда КВН)",
    "Парапапарам",
    "Парни из Баку (команда КВН, 1960-е)",
    "Парни из Баку (команда КВН, 1990-е)",
    "Пирамида (команда КВН)",
    "Полиграф Полиграфыч",
    "ПриМа",
    "Раисы",
    "Русская дорога (команда КВН)",
    "Сборная блондинок Украины",
    "Сборная Владивостока",
    "Сборная Камызякского края",
    "Сборная Краснодарского края",
    "Сборная малых народов",
    "Сборная Пятигорска",
    "Сборная РУДН",
    "Сборная Санкт-Петербурга (команда КВН)",
    "Сборная СССР (команда КВН)",
    "Сборная Физтеха",
    "Сега Мега Драйв 16 бит",
    "СОК (команда КВН)",
    "Союз (команда КВН)",
    "Спарта (команда КВН)",
    "Станция Спортивная (команда КВН)",
    "СТЭПиКо",
    "Так-то",
    "Театр КВН ДГУ",
    "Триод и диод",
    "Уездный город (команда КВН)",
    "Уральские пельмени",
    "Утомлённые солнцем (команда КВН)",
    "Факультет журналистики (команда КВН)",
    "Фёдор Двинятин (команда КВН)",
    "ХАИ (команда КВН)",
    "Четыре татарина",
    "ЧП (команда КВН)",
    "Эскадрон гусар",
]

GAMES_NAMES = [
    "Мир не без добрых людей.",
    "Добрые чувства — соседи любви.",
    "Жизнь дана на добрые дела.",
    "Для дружбы нет расстояний.",
    "Доброе братство дороже богатства.",
    "Верный друг лучше сотни слуг.",
    "Верному другу цены нет.",
    "Хорош друг старый, а дом новый.",
]

SPONSORS = [
    "Лукойл",
    "Сургутнефтегаз",
    "X5 Group",
    "Магнит",
    "Татнефть",
    "Норильский никель",
    "Новатэк",
    "Evraz",
    "Группа компаний «Мегаполис»",
    "НЛМК",
    "UC Rusal",
    "VEON (Vimpelcom)",
    "Северсталь",
    "ММК",
    "СУЭК",
    "МТС",
]

MAX_SPONSORS_REVENUE = 10_000_000

MAX_TEAM_REVENUE = 15_000_000

FIRST_STAGE_MAX_POINTS = [20, 25, 30, 35]

SECOND_STAGE_MAX_POINTS = [40, 50, 60, 70]

THIRD_STAGE_MAX_POINTS = [80, 100, 120, 140]

MAX_JOURNALISTIC_SCORE = 10.0

MAX_VIEWERS_SCORE = 10.0

MAX_PLAYER_SALARY = 220_000

MIN_PLAYER_SALARY = 30_000

CITIES = [
    "Москва",
    "Санкт-Петербург",
    "Новосибирск",
    "Екатеринбург",
    "Нижний Новгород",
    "Самара",
    "Омск",
    "Казань",
    "Челябинск",
    "Ростов-на-Дону",
    "Уфа",
    "Волгоград",
    "Пермь",
    "Красноярск",
    "Воронеж",
    "Саратов",
    "Краснодар",
    "Тольятти",
    "Ижевск",
    "Ульяновск",
    "Барнаул",
    "Владивосток",
    "Ярославль",
]

UNIVERSITIES = [
    "МГУ",
    "СпбГУ",
    "ДВФУ",
    "ННГУ",
    "УрФУ",
    "ОГУ",
    "БГУ",
    "ЯГУ",
    "ТПУ",
    "КГУ",
    "РГУ",
    "ВШЭ",
    "РАНХиГС",
    "МЭИ",
    "МАИ",
    "ОГПУ",
]

MAX_WIN_NUMBER = 10


PLAYERS_NAMES = [
    "Белозёров Велор Иринеевич",
    "Сидоров Юрий Мэлорович",
    "Александров Ираклий Георгьевич",
    "Ширяев Велор Максимович",
    "Сидоров Валентин Наумович",
    "Пахомов Эрнест Яковлевич",
    "Калинин Андрей Авдеевич",
    "Игнатьев Мартын Робертович",
    "Тетерин Арнольд Якунович",
    "Марков Савелий Артёмович",
    "Назаров Ибрагил Дмитрьевич",
    "Самсонов Борис Христофорович",
    "Александров Андрей Романович",
    "Якушев Михаил Игнатьевич",
    "Дорофеев Лавр Андреевич",
    "Рожков Владислав Евгеньевич",
    "Савельев Азарий Олегович",
    "Макаров Филипп Валерьевич",
    "Федосеев Гаянэ Русланович",
    "Никитин Остап Константинович",
    "Мишин Мстислав Григорьевич",
    "Васильев Мстислав Проклович",
    "Щукин Соломон Георгиевич",
    "Карпов Анатолий Евсеевич",
    "Галкин Юлий Артемович",
]

MAX_YEARS_IN_TEAM = 10

MAX_TOTAL_TIME = 15

MAX_TICKET_NUMBER = 10_000

MAX_GAME_REVENUE = 12_000_000

MAX_TV_VIEWERS = 200_000

LEAGUE_NAMES = [
    'Международная',
    'Всероссийская',
    'Кавказская',
    'Европейская',
    'Поволжская',
    'Московская',
    'Премьер-лига',
    'Детская',
    'Старт',
    'Тихоокеанская',
    'Уральская',
    'Содружество',
    'Восточная',
    'Северная'
]

LEAGUE_RANK_TYPES = [
    'high',
    'low',
    'mid',
]